AccumulationRegisters/СостоянияПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СостоянияПоКатегориям</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Скоринг</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСкоринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СостоянияПоКатегориямОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПоКатегориямОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скоринг</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСкоринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИнициаторыСобытийДляДопСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ИнициаторыСобытийДляДопСвойств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъектыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СостоянияПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AccumulationRegisters/СостоянияПоКатегориям/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СостоянияПоКатегориямОстатки.Скоринг,
	                      |	СостоянияПоКатегориямОстатки.Категория,
	                      |	СостоянияПоКатегориямОстаткиРС.Скоринг КАК СкорингРС,
	                      |	СостоянияПоКатегориямОстатки.Объект,
	                      |	СостоянияПоКатегориямОстаткиРС.Объект КАК ОбъектРС
	                      |ИЗ
	                      |	РегистрНакопления.СостоянияПоКатегориям.Остатки КАК СостоянияПоКатегориямОстатки
	                      |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоКатегориямОстатки КАК СостоянияПоКатегориямОстаткиРС
	                      |		ПО СостоянияПоКатегориямОстатки.Объект = СостоянияПоКатегориямОстаткиРС.Объект
	                      |			И СостоянияПоКатегориямОстатки.Скоринг = СостоянияПоКатегориямОстаткиРС.Скоринг
	                      |ГДЕ
	                      |	ЕСТЬNULL(СостоянияПоКатегориямОстатки.Категория, НЕОПРЕДЕЛЕНО) <> ЕСТЬNULL(СостоянияПоКатегориямОстаткиРС.Категория, НЕОПРЕДЕЛЕНО)"); 
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.Объект = Null Тогда //Надо удалить из РС
			Набор = РегистрыСведений.СостоянияПоКатегориямОстатки.СоздатьМенеджерЗаписи();
			Набор.Объект = Результат.ОбъектРС;
			Набор.Скоринг = Результат.СкорингРС;
			Набор.Прочитать();
			Попытка
				Набор.Удалить();
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;	
				
		Иначе //Надо добавить в РС
			Набор = РегистрыСведений.СостоянияПоКатегориямОстатки.СоздатьМенеджерЗаписи();
			Набор.Объект = Результат.Объект;
			Набор.Скоринг = Результат.Скоринг;
			Набор.Категория = Результат.Категория;
			Попытка 
				Набор.Записать();
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	//
	Справочники.ФункцииДополнительныхСвойств.ПроставитьЗначенияДопСвойств(ЭтотОбъект, 
			Перечисления.ИнициаторыСобытийДляДопСвойств.СостоянияПоКатегориям);
КонецПроцедуры
